# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-R18 with FDGFM-enhanced P3-P5 features
# FDGFM: Frequency-guided Directional Gated Fusion Module

# Parameters
nc: 80  # number of classes; will be overridden by dataset yaml, e.g., CCTSDB nc=3
scales:
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

# Backbone
backbone:
  # [from, repeats, module, args]

  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']]  # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]  # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]  # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]                         # 3-P2/4

  # [ch_out, block_type, block_nums, stage_num, act]
  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']]           # 4
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']]          # 5-P3/8
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']]          # 6-P4/16
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']]          # 7-P5/32

# Head
head:
  # -----------------------------
  # RT-DETR Hybrid Encoder / Neck
  # -----------------------------

  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]             # 8 input_proj.2, P5: 512 -> 256
  - [-1, 1, AIFI, [1024, 8]]                                  # 9 AIFI
  - [-1, 1, Conv, [256, 1, 1]]                                # 10 Y5, lateral_convs.0

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                # 11
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]]              # 12 input_proj.1, P4: 256 -> 256
  - [[-2, -1], 1, Concat, [1]]                                # 13 concat Y5_up and P4
  - [-1, 3, RepC3, [256, 0.5]]                                # 14 fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]                                # 15 Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                # 16
  - [5, 1, Conv, [256, 1, 1, None, 1, 1, False]]              # 17 input_proj.0, P3: 128 -> 256
  - [[-2, -1], 1, Concat, [1]]                                # 18 concat Y4_up and P3
  - [-1, 3, RepC3, [256, 0.5]]                                # 19 X3 / P3 feature, fpn_blocks.1

  - [-1, 1, Conv, [256, 3, 2]]                                # 20 downsample_convs.0
  - [[-1, 15], 1, Concat, [1]]                                # 21 concat downsampled P3 and Y4
  - [-1, 3, RepC3, [256, 0.5]]                                # 22 F4 / P4 feature, pan_blocks.0

  - [-1, 1, Conv, [256, 3, 2]]                                # 23 downsample_convs.1
  - [[-1, 10], 1, Concat, [1]]                                # 24 concat downsampled P4 and Y5
  - [-1, 3, RepC3, [256, 0.5]]                                # 25 F5 / P5 feature, pan_blocks.1

  # -----------------------------
  # FDGFM Enhancement
  # args: [patch_size, expansion, reduction]
  # actual call in parse_model:
  # FDGFM(ch[f], patch_size, expansion, reduction)
  # -----------------------------

  - [19, 1, FDGFM, [8, 0.5, 8]]                               # 26 FDGFM-P3, small-object detail enhancement
  - [22, 1, FDGFM, [8, 0.5, 8]]                               # 27 FDGFM-P4, mid-level structure enhancement
  - [25, 1, FDGFM, [8, 0.5, 8]]                               # 28 FDGFM-P5, high-level semantic enhancement

  # -----------------------------
  # RT-DETR Decoder
  # parse_model automatically inserts channels [256, 256, 256]
  # -----------------------------

  - [[26, 27, 28], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # 29 Detect(FDGFM-P3, FDGFM-P4, FDGFM-P5)